temp/tkinter.html
<!DOCTYPE html>
<html lang="fr">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tkinter pour le Puissance 4</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../theme/personal/src/personalStyle.css"/>
<link rel="stylesheet" href="../theme/personal/src/highlight/styles/monokai-sublime.min.css"/>
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">Tkinter pour le Puissance 4</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table des matières</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#grid">Utiliser la méthode grid pour l'interface du Puissance 4</a>
<ul>
<li><a href="#ressources">Ressources</a></li>
<li><a href="#pourquoi-grid">Pourquoi une Grid pour le Puissance 4 ?</a></li>
<li><a href="#etapes">Etape par étape</a></li>
</ul>
</li>
<li><a href="#solution2">Autre solution sans la méthode grid</a>
<ul>
<li><a href="#stockage-formes">Stockage des formes du canvas dans une liste</a></li>
<li><a href="#detection-forme">Détection de la forme cliquée dans un canvas</a></li>
<li><a href="#find-below">Cas d'une forme sous une autre</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-grid" class="outline-2">
<h2 id="grid">Utiliser la méthode grid pour l'interface du Puissance 4</h2>
<div class="outline-text-2" id="text-grid">
</div>

<div id="outline-container-ressources" class="outline-3">
<h3 id="ressources">Ressources</h3>
<div class="outline-text-3" id="text-ressources">
<p target="_blank">
<a href="https://koor.fr/Python/Tutoriel_Tkinter/tkinter_layout_grid.wp" target="_blank">https://koor.fr/Python/Tutoriel_Tkinter/tkinter_layout_grid.wp</a>
</p>
</div>
</div>

<div id="outline-container-pourquoi-grid" class="outline-3">
<h3 id="pourquoi-grid">Pourquoi une Grid pour le Puissance 4 ?</h3>
<div class="outline-text-3" id="text-pourquoi-grid">
<p>
La méthode grid sert à positionner des éléments (=widgets) dans notre écran en fonction d'un positionnement matriciel. Comme nous utilisons une matrice, c'est à dire une liste de listes, pour placer nos jetons sur le plateau, c'est la méthode la plus adaptée. Il faudra associer à chaque cellule créée le clic de la souris et la fonction qui placera le jeton.
</p>
</div>
</div>

<div id="outline-container-etapes" class="outline-3">
<h3 id="etapes">Etape par étape</h3>
<div class="outline-text-3" id="text-etapes">
</div>
<div id="outline-container-org6e96b4a" class="outline-4">
<h4 id="org6e96b4a">Pré-requis</h4>
<div class="outline-text-4" id="text-org6e96b4a">
<p>
Il faut déjà avoir initialisé ta grille de puissance 4 avant de paramétrer l'affichage car tu auras besoin de la taille de la grille et des éventuelles valeurs des cases.
</p>
</div>
</div>

<div id="outline-container-org3f9bef2" class="outline-4">
<h4 id="org3f9bef2">Initialisation</h4>
<div class="outline-text-4" id="text-org3f9bef2">
<ol class="org-ol">
<li>Crée un objet Tk() (<code>window = tkinter.Tk()</code>).</li>
<li>Configure la fenêtre (titre, fond, etc).</li>
<li>Crée un dictionnaire vide qui contiendra tous les widgets de la grille (<code>widgets = {}</code>).</li>
</ol>
</div>
</div>

<div id="outline-container-org898585f" class="outline-4">
<h4 id="org898585f">Création des widgets</h4>
<div class="outline-text-4" id="text-org898585f">
<ol class="org-ol">
<li><p>
A l'aide d'une double boucle imbriquée (pour parcourir la grille de puissance 4), il faut pour chaque case de la grille créer une cellule pour ton affichage (une cellule sera un Label()). Exemple à l'intérieur de la boucle:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">cell</span> = Label(window, text=<span style="font-style: italic;">" "</span>, bg=<span style="font-style: italic;">'white'</span>)
cell.grid(row = i, column = j)
cell.bind(<span style="font-style: italic;">'&lt;Button-1&gt;'</span>, clic)
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">clic correspond &#224; une fonction qui faudra d&#233;finir et qui sera lanc&#233;e uniquement lorsque l'on clique sur une cellule.</span>
<span style="font-weight: bold; font-style: italic;">widgets</span>[(i,j)] = cell
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">utiliser le (i,j) comme cl&#233; permettra de retrouver le widget correspondant &#224; une case de la grille de puissance 4.</span>
</pre>
</div></li>

<li><p>
La fonction clic doit récupérer l'information de la colonne sélectionnée et lancer la fonction qui trouve la bonne ligne pour placer le jeton. Exemple de début de la fonction :
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">clic</span>(event):
    <span style="font-weight: bold; font-style: italic;">cell</span> = event.widget
    <span style="font-weight: bold; font-style: italic;">col</span> = <span style="font-weight: bold;">int</span>(cell.grid_info()[<span style="font-style: italic;">'column'</span>])
    <span style="font-weight: bold; font-style: italic;">ligne</span> = trouver_ligne(col)
    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Le reste &#224; impl&#233;menter</span>
</pre>
</div></li>
</ol>
</div>
</div>
</div>
</div>

<div id="outline-container-solution2" class="outline-2">
<h2 id="solution2">Autre solution sans la méthode grid</h2>
<div class="outline-text-2" id="text-solution2">
</div>
<div id="outline-container-stockage-formes" class="outline-3">
<h3 id="stockage-formes">Stockage des formes du canvas dans une liste</h3>
<div class="outline-text-3" id="text-stockage-formes">
<p>
Au moment de créer les formes dans le canvas, tu peux les stocker dans une liste de la même forme que celle qui contient la grille du puissance 4. Exemple :
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">canvas</span> = Canvas(root, ...)
<span style="font-weight: bold; font-style: italic;">formes</span> = []
<span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(<span style="font-weight: bold;">len</span>(grille)):
    formes.append([])
    <span style="font-weight: bold;">for</span> j <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(<span style="font-weight: bold;">len</span>(grille[i])):
        formes[i].append(canvas.create_oval(...))
</pre>
</div>
</div>
</div>

<div id="outline-container-detection-forme" class="outline-3">
<h3 id="detection-forme">Détection de la forme cliquée dans un canvas</h3>
<div class="outline-text-3" id="text-detection-forme">
<p>
On peut détecter assez facilement sur quelle forme était la souris lorsqu'elle a déclenché l'évènement <code>'&lt;Button-1&gt;'</code> en utilisant la méthode disponible dans notre canvas <code>canvas.find_closest(x,y)</code>.
</p>
</div>
<div id="outline-container-org43eda60" class="outline-4">
<h4 id="org43eda60">Démonstration</h4>
<div class="outline-text-4" id="text-org43eda60">
<ul class="org-ul">
<li><p>
Tu peux utiliser la méthode bind directement dans le canvas après l'avoir créé :
</p>
<div class="org-src-container">
<pre class="src src-python">canvas.bind(<span style="font-style: italic;">'&lt;Button-1&gt;'</span>, click)
</pre>
</div></li>

<li><p>
Dans la fonction <code>click(event)</code>, tu retrouves l'élément le plus proche du clic et tu retrouves les coordonnées correspondantes grâce à la liste ou au dictionnaire dans laquelle/lequel tu as mis tous les items créés au fur et à mesure :
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">item</span> = canvas.find_closest(event.x, event.y)
<span style="font-weight: bold; font-style: italic;">colonne</span> = <span style="font-weight: bold; text-decoration: underline;">None</span>
<span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">Retrouver la position de la forme dans la liste de stockage</span>
<span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(<span style="font-weight: bold;">len</span>(formes)):
    <span style="font-weight: bold;">for</span> j <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(<span style="font-weight: bold;">len</span>(formes[i])):
        <span style="font-weight: bold;">if</span> formes[i][j] == item:
           <span style="font-weight: bold; font-style: italic;">colonne</span> = j
           <span style="font-weight: bold;">break</span>
</pre>
</div></li>
</ul>
<p>
Après cette étape, tu as retrouvé la colonne de la forme sur laquelle on a cliqué et tu peux utiliser tes fonctions codées auparavant avec cette information.
</p>
</div>
</div>
</div>
<div id="outline-container-find-below" class="outline-3">
<h3 id="find-below">Cas d'une forme sous une autre</h3>
<div class="outline-text-3" id="text-find-below">
<p>
Normalement, la méthode <code>find_closest()</code> devrait suffire mais il se peut que tu aies besoin de trouver quelle forme se trouve en-dessous de celle sur laquelle on a cliqué. Il faudra utiliser pour cela la méthode <code>find_below(item)</code> pour trouver la forme en dessous d'une autre.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
